app/views/articles/_article.html.erb

SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 11], ["LIMIT", 1]]
---
                            </span>
                                <% if article.categories.any? %>