app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
            <div class="col-sm-7 select-category-box">
                <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>