app/views/articles/show.html.erb

            <span class="username-title font-raleway"><%= link_to @article.user.username, user_path(@article.user) %></span><br/>
            <span class="user-articles-count font-roboto font-weight-400 col-light-black-3"><%= pluralize(@article.user.articles.count, "article")%></span>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]


    <% if @article.categories.any? %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 11], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 25]]