app/views/users/index.html.erb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]
SELECT COUNT(*) FROM "users"
---
                <span class="username-title"><%= link_to user.username, user_path(user) %></span>
                | <span class="user-articles-count"><%= pluralize(user.articles.count, "article")%></span>