app/views/users/show.html.erb


<%if @user.articles.length > 0 %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]