app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
    def index
        @articles = Article.paginate(page: params[:page], per_page: 5)

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title 2"], ["description", "description 2"], ["created_at", "2017-07-05 23:02:51.786996"], ["updated_at", "2017-07-05 23:02:51.786996"]]
---
    def create
        # render plain: params[:article].inspect
        @article = Article.new(article_params)
        @article.user = current_user
        if @article.save

UPDATE "articles" SET "user_id" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["user_id", 4], ["description", "another description from command line and edited"], ["updated_at", "2017-07-22 16:18:58.266933"], ["id", 22]]
---
    def update
        @article.user = current_user
        if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
    def destroy
        if @article.destroy