app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"
---
    def index
        @categories = Category.paginate(page: params[:page], per_page: 10)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "categories".* FROM "categories"
---
    def show
        @category = Category.find(params[:id])
        @category_articles = @category.articles.paginate(page: params[:page], per_page: 5)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def update
        @category = Category.find(params[:id])