app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "joe1234@gmail.com"], ["password_digest", "$2a$10$Ysz5pG3iv7crCRKQ4XyOwOOf65JnwRP.jzlx3d05eTl5kOKMLLwq6"], ["updated_at", "2017-07-20 20:49:11.315039"], ["id", 4]]
---
    def update
        if @user.update(user_params)

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]
---
    def show
        @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)