app/views/categories/index.html.erb

                                <li><%= link_to category.name.capitalize , category_path(category) %></li>
                                <li><small><%= pluralize(category.articles.count, "article") %></small></li>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]