app/views/layouts/_navigation.html.erb

              <div class="category-limit-view">
                <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"